In [1]:
%load_ext sql

In [2]:
import configparser
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

DB_ENDPOINT        = config.get("CLUSTER","HOST")
DB_NAME            = config.get("CLUSTER","DB_NAME")
DB_USER            = config.get("CLUSTER","DB_USER")
DB_PASSWORD        = config.get("CLUSTER","DB_PASSWORD")
DB_PORT            = config.get("CLUSTER","DB_PORT")

In [3]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB_NAME)
%sql $conn_string

'Connected: dwhuser@dwh'

In [14]:
%sql select count(1) from artists;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(10025,)]

In [15]:
%sql select * from artists LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('ARTPL6J1187FB4D6FB', 'John Patitucci', 'Brooklyn, NY', 40.65507, -73.94888),
 ('ARJXZX41187B9B6A43', 'Dream Warriors', 'Toronto, Ontario, Canada', None, None),
 ('ARLCD3T1187FB57501', 'Charlotte Diamond', 'CANADA - Ontario', 49.38426, -84.75627),
 ('ARNPI7B1187FB3DCB7', 'Jorge Ben Jor', '', None, None),
 ('ARGCVZG1187B9B916F', 'Hayseed Dixie', '', None, None)]

In [16]:
%sql select count(1) from songs;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(14896,)]

In [17]:
%sql select * from songs LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('SOTQRAP12A8C137193', 'Show Me What You Got', 'ARJB8QW1187B9B059E', 2008, 247.37914),
 ('SOCAEYG12AB01849C0', "Let's Blame The Lightman", 'ARO3SS31187FB3729C', 1997, 189.57016),
 ('SOLYAYO12A8C13C04D', "I Don't Want To Talk About It", 'ARRXG5Y1187B9AA016', 0, 274.78159),
 ('SOKARQT12A58A78B7B', 'Panoptica', 'AR1XL241187FB3F4AB', 0, 355.99628),
 ('SOENOSR12A8C13A90E', 'freesia', 'AR54HGU1187FB5ACDE', 2007, 262.5824)]

In [18]:
%sql select count(1) from songplays;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(6820,)]

In [19]:
%sql select * from songplays LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(12, 1541381694796, '44', 'paid', None, None, 237, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (76, 1541413747796, '42', 'paid', None, None, 129, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (140, 1541416917796, '95', 'paid', None, None, 222, 'Winston-Salem, NC', '"Mozilla/5.0 (iPhone; CPU iPhone OS 7_1_2 like Mac OS X) AppleWebKit/537.51.2 (KHTML, like Gecko) Version/7.0 Mobile/11D257 Safari/9537.53"'),
 (204, 1541428431796, '44', 'paid', None, None, 269, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (268, 1541150017796, '89', 'free', None, None, 88, 'Cedar Rapids, IA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [20]:
%sql select count(1) from time;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(8023,)]

In [21]:
%sql select * from time LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(1541377992796, 0, 5, 45, 11, 2018, '1'),
 (1541382653796, 1, 5, 45, 11, 2018, '1'),
 (1541384741796, 2, 5, 45, 11, 2018, '1'),
 (1541386559796, 2, 5, 45, 11, 2018, '1'),
 (1541393249796, 4, 5, 45, 11, 2018, '1')]

In [22]:
%sql select count(1) from users;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(107,)]

In [23]:
%sql select * from users LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.ci1ccxqm4fly.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('49', 'Chloe', 'Cuevas', 'F', 'free'),
 ('80', 'Tegan', 'Levine', 'F', 'free'),
 ('48', 'Marina', 'Sutton', 'F', 'free'),
 ('100', 'Adler', 'Barrera', 'M', 'free'),
 ('53', 'Celeste', 'Williams', 'F', 'free')]